In [3]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          439                 48
1        UAS1         Fisika                          305                 69
2        UTS2         Fisika                          516                 82
3        UAS2         Fisika                          597                 42
4        UTS1     Matematika                          252                 77
5        UAS1     Matematika                          322                 44
6        UTS2     Matematika                          272                 76
7        UAS2     Matematika                          503                 68
8        UTS1     Statistika                          485                 74
9        UAS1     Statistika                          361                 68
10       UTS2     Statistika                          686                 45
11       UAS2     Statistika                          357                 98



---



---

## Soal 1. Data Cleaning

Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil

*   Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil
*   Tipe Ujian dan Mata pelajaran apakah yang memiliki rata2 nilai terkecil?

In [4]:
#code here
rata2 = df.sort_values('Rata2 Nilai Ujian',ascending=False).reset_index(drop=True)
rata2

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UAS2     Statistika                          357                 98
1        UTS2         Fisika                          516                 82
2        UTS1     Matematika                          252                 77
3        UTS2     Matematika                          272                 76
4        UTS1     Statistika                          485                 74
5        UAS1         Fisika                          305                 69
6        UAS2     Matematika                          503                 68
7        UAS1     Statistika                          361                 68
8        UTS1         Fisika                          439                 48
9        UTS2     Statistika                          686                 45
10       UAS1     Matematika                          322                 44
11       UAS2         Fisika                          597                 42

In [5]:
akh = len(rata2)
nilai = rata2["Tipe Ujian"][akh-1]
mapel = rata2["Mata Pelajaran"][akh-1]

print(f'Tipe ujian yang memiliki rata2 nilai terkecil adalah {nilai}')
print(f'Mata pelajaran yang memiliki rata2 nilai terkecil adalah {mapel}')

Tipe ujian yang memiliki rata2 nilai terkecil adalah UAS2
Mata pelajaran yang memiliki rata2 nilai terkecil adalah Fisika

Expected output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1iv8P-LDdN3WpTVX9qST3kL7QSNSDiOc2)



---



---

<h2>Soal 2: Data Restructuring</h2>

Jelaskan itu pivoting dan melting data

- Pivoting mengubah bentuk _Dataframe_ dimana salah satu kolom menjadi header dan satu kolom lain menjadi index, sehingga data yang tadinya panjang menjadi lebar
- Melting bisa dibilang adalah kebalikan dari Pivoting, dimana beberapa header bisa dikelompokkan dalam satu baris sehingga data yang tadinya lebar bisa menjadi panjang



---



---

<h2>Soal 3: Reshaping Data 1</h2>

In [72]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df2 = pd.DataFrame(data)
df2

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          601                 61
1        UAS1         Fisika                          747                 97
2        UTS2         Fisika                          413                 69
3        UAS2         Fisika                          728                 64
4        UTS1     Matematika                          761                 64
5        UAS1     Matematika                          218                 56
6        UTS2     Matematika                          563                 64
7        UAS2     Matematika                          388                 84
8        UTS1     Statistika                          296                 94
9        UAS1     Statistika                          670                 84
10       UTS2     Statistika                          312                 91
11       UAS2     Statistika                          785                 49

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [73]:
#code here
pd.pivot_table(df2, index='Tipe Ujian', columns='Mata Pelajaran')

               Rata2 Nilai Ujian                        \
Mata Pelajaran            Fisika Matematika Statistika
Tipe Ujian
UAS1                          97         56         84
UAS2                          64         84         49
UTS1                          61         64         94
UTS2                          69         64         91

               Rata2 Waktu Belajar (menit)
Mata Pelajaran                      Fisika Matematika Statistika
Tipe Ujian
UAS1                                   747        218        670
UAS2                                   728        388        785
UTS1                                   601        761        296
UTS2                                   413        563        312

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)



---



---

<h2>Soal 4: Reshaping Data 2</h2>

In [88]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df3 = pd.DataFrame(data).set_index('Hari')
df3

        Kebun Binatang  Dufan  Disney  Bali
Hari
Sabtu              271    501    1000   900
Minggu             399    700    1001   803

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

In [92]:
#code here
df4 = df3.reset_index()
pd.melt(df4,id_vars='Hari',var_name='Tempat Hiburan',value_name='Pengunjung')

     Hari  Tempat Hiburan  Pengunjung
0   Sabtu  Kebun Binatang         271
1  Minggu  Kebun Binatang         399
2   Sabtu           Dufan         501
3  Minggu           Dufan         700
4   Sabtu          Disney        1000
5  Minggu          Disney        1001
6   Sabtu            Bali         900
7  Minggu            Bali         803

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)



---



---

<h2>Soal 5: Data Enrichment</h2>

Lakukan binning data menggunakan qcut sehingga sesuai hasil yang diharapkan

In [93]:
#code here
hasil = pd.qcut(df["Rata2 Nilai Ujian"],q=3,labels=["Tidak lulus","remedial","LULUS"])
df["Kelulusan"]=hasil
df

,Tipe Ujian,Mata Pelajaran,Rata2 Waktu Belajar (menit),Rata2 Nilai Ujian,Kelulusan
0,UTS1,Fisika,739,75,remedial
1,UAS1,Fisika,525,92,LULUS
2,UTS2,Fisika,799,61,Tidak lulus
3,UAS2,Fisika,417,95,LULUS
4,UTS1,Matematika,775,68,Tidak lulus
5,UAS1,Matematika,499,77,remedial
6,UTS2,Matematika,789,74,remedial
7,UAS2,Matematika,672,76,remedial
8,UTS1,Statistika,209,43,Tidak lulus
9,UAS1,Statistika,361,92,LULUS
10,UTS2,Statistika,331,64,Tidak lulus
11,UAS2,Statistika,433,99,LULUS

Expected Output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1h2_u5_xhD1_QtPpItTj-o3lljHhnr4XS)



---



---